DataProcessors/ТестированиеЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеЗнаний</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДанныеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Опыт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СложностиСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СложностиСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШестьОтветов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетыреОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыВикторины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыВикторины</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдинСборникБезОстановки</Name>
					<Comment>Бесконечные вопросы по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлучайныйСборник</Name>
					<Comment>Бесконечные вопросы по случайным сборникам на каждый вопрос</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытание</Name>
					<Comment>100 вопросов по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восхождение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПараметровИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПараметровИгроков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БлокировкаЛечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бомба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Горение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛедянойЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МентальныйЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неуклюжесть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проклятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сила</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтеклянныйЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущееЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Щит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШепотИзБездны</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Достижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Достижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДвадцатьВопросовЗаШестьдесятСекунд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеВосхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерияДвадцатьПравильных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоВопросовСыграно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТридцатьВопросовБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоПятнадцатьСборников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Задания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Задания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Сборники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстВопросаЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыЗаданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Противники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Противники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиПротивников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияЦикла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеЦикла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПротивников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сборники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСборника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСборника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьОтветыИзТекущегоСборника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТестированиеЗнаний/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Перем Гсч;		// Генератор случайных чисел.

&НаКлиенте
Перем ГсчКлиент;

// Помещает картинку задания ЗаданиеВход во временное хранилище и 
// возвращает его адрес.
&НаСервере
Функция ВернутьАдресКартинки(ЗаданиеВход)
	РезультатФункции = "";
	КартинкаХранилище = ЗаданиеВход.КартинкаЗадания;
	КартинкаЗначение = КартинкаХранилище.Получить();
	Если КартинкаЗначение <> Неопределено Тогда
		РезультатФункции = ПоместитьВоВременноеХранилище(КартинкаЗначение, ЭтаФорма);
	Иначе
		Сборник = ЗаданиеВход.Владелец;
		КартинкаХранилище = Сборник.КартинкаСборника;
		КартинкаЗначение = КартинкаХранилище.Получить();
		Если КартинкаЗначение <> Неопределено Тогда
			РезультатФункции = ПоместитьВоВременноеХранилище(КартинкаЗначение, ЭтаФорма);
		Иначе
			// Картинка не задана. Не загружаем.
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ВернутьАдресКартинки()

// Возвращает структуру данных для задания ЗаданиеВход.
&НаСервере
Функция ПолучитьВариантыОтветов(ЗаданиеВход)
	// Инициализация.
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("НомерПравильного", 0);
	РезультатФункции.Вставить("МассивОтветов", Новый Массив);
	ВыгрузкаОтветов = ЗаданиеВход.ОтветыЗаданий.Выгрузить();
	КоличествоОтветов = 6;
	Если Сборник.Сложность = Перечисления.СложностиСборников.ШестьОтветов Тогда
		КоличествоОтветов = 6;
	ИначеЕсли Сборник.Сложность = Перечисления.СложностиСборников.ЧетыреОтвета Тогда
		КоличествоОтветов = 4;
	Иначе
		КоличествоОтветов = 6;
	КонецЕсли;
	// Поиск правильного ответа.
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Правильность", Истина);
	НайденныеСтроки = ВыгрузкаОтветов.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 1 Тогда
		ПравильныйОтветСтрока = НайденныеСтроки[0];
		ПравильныйОтветТекст = ПравильныйОтветСтрока.ТекстОтвета;
		// Добавление неправильных ответов.
		МассивНеправильных = Новый Массив;
		ТекСборник = ЗаданиеВход.Владелец;
		Если ТекСборник.БратьОтветыИзТекущегоСборника Тогда
			// Ответы берутся только из текущего вопроса.
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаданияОтветыЗаданий.ТекстОтвета,
			|	ЗаданияОтветыЗаданий.Правильность
			|ИЗ
			|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
			|ГДЕ
			|	ЗаданияОтветыЗаданий.Ссылка = &Ссылка
			|	И НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления
			|	И НЕ ЗаданияОтветыЗаданий.Правильность";
			Запрос.УстановитьПараметр("Ссылка", ЗаданиеВход);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивНеправильных.Добавить(ВыборкаДетальныеЗаписи.ТекстОтвета);
			КонецЦикла;
		Иначе
			// Ответы берутся из всех вопросов.
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданияОтветыЗаданий.ТекстОтвета
			|ИЗ
			|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
			|ГДЕ
			|	ЗаданияОтветыЗаданий.ТекстОтвета <> &ТекстОтвета
			|	И НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления
			|	И ЗаданияОтветыЗаданий.Ссылка.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец", ЗаданиеВход.Владелец);
			Запрос.УстановитьПараметр("ТекстОтвета", ПравильныйОтветТекст);
			РезультатЗапроса = Запрос.Выполнить();
			ВыгрузкаНеправильных = РезультатЗапроса.Выгрузить();
			МассивВыгрузка = ВыгрузкаНеправильных.ВыгрузитьКолонку("ТекстОтвета");
			ВсегоНеправильных = МассивВыгрузка.Количество();
			ВерхняяГраница = 1;
			Если МассивВыгрузка.Количество() >= (КоличествоОтветов - 1) Тогда
				ВерхняяГраница = (КоличествоОтветов - 1);
			Иначе
				ВерхняяГраница = МассивВыгрузка.Количество();
			КонецЕсли;
			Для Счетчик = 1 По ВерхняяГраница Цикл
				НомерОтвета = Гсч.СлучайноеЧисло(0, ВсегоНеправильных-1);
				МассивНеправильных.Добавить(МассивВыгрузка[НомерОтвета]);
			КонецЦикла;
		КонецЕсли;
		МассивНеправильных.Добавить(ПравильныйОтветТекст);
		// Перемешивание итогового массива и формирование результата.
		МассивНеправильных = ОбщегоНазначенияКлиентСервер.СмешатьМассив(МассивНеправильных, Гсч);
		ПравильныйОтветНомер = МассивНеправильных.Найти(ПравильныйОтветТекст);
		Если ПравильныйОтветНомер <> Неопределено Тогда
			РезультатФункции.Вставить("НомерПравильного", ПравильныйОтветНомер + 1);
			РезультатФункции.Вставить("МассивОтветов", МассивНеправильных);
		Иначе
			РезультатФункции.Вставить("НомерПравильного", 0);
			РезультатФункции.Вставить("МассивОтветов", Новый Массив);
		КонецЕсли;
	Иначе
		// Не удалось однозначно определить правильный ответ.
		РезультатФункции.Вставить("НомерПравильного", 0);
		РезультатФункции.Вставить("МассивОтветов", Новый Массив);
	КонецЕсли;
	// Вывод результата.
	Возврат РезультатФункции;
КонецФункции		// ПолучитьВариантыОтветов()

&НаСервере
Процедура ЗагрузитьОтветВЭлемент(МассивОтветовВход, НомерОтветаВход, ЭлементВход)
	Если МассивОтветовВход.Количество() > НомерОтветаВход Тогда
		ЭлементВход.Заголовок = Строка(НомерОтветаВход + 1) + ": " + СокрЛП(МассивОтветовВход[НомерОтветаВход]);
	Иначе	
		ЭлементВход.Заголовок = "---";
	КонецЕсли;
КонецПроцедуры

// Возвращает текстовое представление события формы При загрузке задания.
&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСобытияФормы_ПриЗагрузкеЗадания()
	Возврат "СобытиеФормы_ПриЗагрузкеЗадания";
КонецФункции		 // ПредставлениеСобытияФормы_ПриЗагрузкеЗадания()

#Область Модификаторы

// Осуществляет применение модификатора Интуиция.
//
&НаСервере
Процедура ПрименитьМодификатор_Интуиция()
	МассивНеверных = Новый Массив;
	ЗначениеНайдено = Ложь;
	ВсегоОтветов = 6;
	Пока НЕ ЗначениеНайдено Цикл
		НомерОтвета = Гсч.СлучайноеЧисло(0, ВсегоОтветов - 1);
		Если НомерОтвета <> НомерПравильногоОтвета Тогда
			МассивНеверных.Добавить(НомерОтвета);
			ЗначениеНайдено = Истина;
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;
	КонецЦикла;
	УбратьНеверныеОтветы(МассивНеверных, ЭтаФорма);
	НеверныеВариантыУбраны = Истина;
	УправлениеВидимостью();
КонецПроцедуры		// ПрименитьМодификатор_Интуиция()

// Осуществляет применение модификатора МодификаторВход.
// 
// Параметры:
//	МодификаторВход - СправочникСсылка.Модификаторы - модификатор для применения.
//	ЕстьДлительностьВход - Булево - признак наличия длительности.
//	ОставшаясяДлительностьВход - Число - оставшаяся длительность.
//
&НаСервере
Процедура ПрименитьВыбранныйМодификатор(МодификаторВход, ЕстьДлительностьВход, ОставшаясяДлительностьВход)
	Если МодификаторВход = Справочники.Модификаторы.Интуиция Тогда
		ПрименитьМодификатор_Интуиция();
	Иначе
		Сообщить("Неизвестный модфикатор: " + МодификаторВход);
		// Неизвестный модификатор.
	КонецЕсли;	
КонецПроцедуры		// ПрименитьВыбранныйМодификатор()

// Применяет модификатор МодификаторВход, если он присутствует в таблице Модификаторы.
// 
// Параметры:
//	МодификаторВход - СправочникСсылка.Модификаторы - модификатор для применения.
//
&НаСервере
Процедура ПрименитьМодификаторПриНаличии(МодификаторВход)
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Модификатор", МодификаторВход);
	НайденныеСтроки = Модификаторы.НайтиСтроки(СтруктураПоиска);
	Для Каждого ТекНайденныеСтроки Из НайденныеСтроки Цикл
		ТекЕстьДлительность			 = ТекНайденныеСтроки.ЕстьДлительность;
		ТекОставшаясяДлительность	 = ТекНайденныеСтроки.ОставшаясяДлительность;
		ПрименитьВыбранныйМодификатор(МодификаторВход, ТекЕстьДлительность, ТекОставшаясяДлительность);		
	КонецЦикла;	
КонецПроцедуры		// ПрименитьМодификаторПриНаличии()

// Применяет модификаторы для наступившего события СобытиеВход.
//
// Параметры:
//	СобытиеВход - Строка - имя события.
//
&НаСервере
Процедура ПрименитьМодификаторыПриСобытии(СобытиеВход)
	ЭтоРежимВосхождение = (РежимВикторины = Перечисления.РежимыВикторины.Восхождение);
	Если ЭтоРежимВосхождение Тогда
		Если СобытиеВход = ПредставлениеСобытияФормы_ПриЗагрузкеЗадания() Тогда
			ПрименитьМодификаторПриНаличии(Справочники.Модификаторы.Интуиция);
		Иначе	
			// Неизвестное событие. ничего не делаем.
		КонецЕсли;
	Иначе
		// Не используем модификаторы для других режимов викторины.
	КонецЕсли;
КонецПроцедуры		 // ПрименитьМодификаторы()

#КонецОбласти

// Размещает случайного противника на форму.
//
&НаСервере
Процедура ЗагрузитьПротивника()
	Противник = Справочники.Противники.ПолучитьСлучайногоПротивника(ГСЧ);
КонецПроцедуры		// ЗагрузитьПротивника()

// Возвращает начальное значение здоровья игрока по умолчанию.
//
&НаСервере
Функция НачальноеЗдоровьеИгрокаПоУмолчанию()
	Возврат 30;
КонецФункции

// Получает значение параметра игрока из таблицы ПараметрыИгрока по виду параметра.
//
// Параметры:
//  ВидПараметраВход - ПеречислениеСсылка.ВидыПараметровИгроков - вид параметра для поиска.
//
// Возвращаемое значение:
//  Число - значение параметра игрока, или 0 если параметр не найден.
//
&НаСервере
Функция ПолучитьЗначениеПараметраИгрока(ВидПараметраВход)
	РезультатФункции = 0;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВидПараметра", ВидПараметраВход);
	НайденныеСтроки = ПараметрыИгрока.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		РезультатФункции = НайденныеСтроки[0].ЗначениеПараметра;
	Иначе
		РезультатФункции = 0;
		Сообщить("Параметр игрока " + Строка(ВидПараметраВход) + " не найден");
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьЗначениеПараметраИгрока()

// Устанавливает значение параметра игрока в таблице ПараметрыИгрока по виду параметра.
//
// Параметры:
//  ВидПараметраВход - ПеречислениеСсылка.ВидыПараметровИгроков - вид параметра для поиска.
//  ЗначениеПараметраВход - Число - значение параметра для установки.
//
&НаСервере
Процедура УстановитьПараметрИгрока(ВидПараметраВход, ЗначениеПараметраВход)
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВидПараметра", ВидПараметраВход);
	НайденныеСтроки = ПараметрыИгрока.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].ЗначениеПараметра = ЗначениеПараметраВход;
	Иначе
		НоваяСтрока = ПараметрыИгрока.Добавить();
		НоваяСтрока.ВидПараметра = ВидПараметраВход;
		НоваяСтрока.ЗначениеПараметра = ЗначениеПараметраВход;
	КонецЕсли;
КонецПроцедуры		// УстановитьПараметрИгрока()

// Устанавливает значение параметра противника в таблице ПараметрыПротивника по виду параметра.
//
// Параметры:
//  ВидПараметраВход - ПеречислениеСсылка.ВидыПараметровИгроков - вид параметра для поиска.
//  ЗначениеПараметраВход - Число - значение параметра для установки.
//
&НаСервере
Процедура УстановитьПараметрПротивника(ВидПараметраВход, ЗначениеПараметраВход)
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВидПараметра", ВидПараметраВход);
	НайденныеСтроки = ПараметрыПротивника.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].ЗначениеПараметра = ЗначениеПараметраВход;
	Иначе
		НоваяСтрока = ПараметрыПротивника.Добавить();
		НоваяСтрока.ВидПараметра = ВидПараметраВход;
		НоваяСтрока.ЗначениеПараметра = ЗначениеПараметраВход;
	КонецЕсли;
КонецПроцедуры		// УстановитьПараметрПротивника()

// Осуществляет инициализацию игрока.
&НаСервере
Процедура ИнициализироватьИгрока()
	// Инициализация параметров игрока
	ВидПараметраТекущееЗдоровье = Перечисления.ВидыПараметровИгроков.ТекущееЗдоровье;
	ВидПараметраМаксимальноеЗдоровье = Перечисления.ВидыПараметровИгроков.МаксимальноеЗдоровье;
	ЗначениеЗдоровья = НачальноеЗдоровьеИгрокаПоУмолчанию();
	УстановитьПараметрИгрока(ВидПараметраТекущееЗдоровье, ЗначениеЗдоровья);
	УстановитьПараметрИгрока(ВидПараметраМаксимальноеЗдоровье, ЗначениеЗдоровья);
	// Считывание текущего здоровья из таблицы параметров и размещение в реквизит формы
	ТекущееЗдоровьеИгрока = ПолучитьЗначениеПараметраИгрока(ВидПараметраТекущееЗдоровье);
КонецПроцедуры		// ИнициализироватьИгрока()

// Осуществляет инициализацию противника.
&НаСервере
Процедура ИнициализироватьПротивника()
	ЗагрузитьПротивника();
	// Инициализация параметров противника
	ВидПараметраТекущееЗдоровье = Перечисления.ВидыПараметровИгроков.ТекущееЗдоровье;
	ВидПараметраМаксимальноеЗдоровье = Перечисления.ВидыПараметровИгроков.МаксимальноеЗдоровье;
	ЗначениеЗдоровья = НачальноеЗдоровьеИгрокаПоУмолчанию();
	УстановитьПараметрПротивника(ВидПараметраТекущееЗдоровье, ЗначениеЗдоровья);
	УстановитьПараметрПротивника(ВидПараметраМаксимальноеЗдоровье, ЗначениеЗдоровья);
КонецПроцедуры		// ИнициализироватьПротивника()

// Осуществляет инициализацию нового восхождения.
&НаСервере
Процедура ИнициализироватьРежимВосхождение()
	НовоеМаксимальноеЗдорорвьеИгрока = 100;
	ЗагрузитьМодификаторыПоУмолчанию();
	// Инициализация игрока
	ИнициализироватьИгрока();
	// Инициализация противника
	ИнициализироватьПротивника();
КонецПроцедуры		// ИнициализироватьРежимВосхождение()

// Отображает на форме задание и запоминает правильный ответ.
&НаСервере
Процедура ЗагрузитьЗадание(ЗаданиеВход)
	// Отображение текста вопроса.
	ВыбранноеЗадание = ЗаданиеВход;
	ЕстьПовторяющиеся = Истина;
	Счетчик = 0;
	Пока (ЕстьПовторяющиеся) И (Счетчик < 100) Цикл
		СтруктураВариантовОтветов = ПолучитьВариантыОтветов(ЗаданиеВход);	
		МассивОтветов = СтруктураВариантовОтветов.МассивОтветов;
		ЕстьПовторяющиеся = Обработки.ТестированиеЗнаний.ОпределитьПовторяющиесяОтветы(МассивОтветов);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Если МассивОтветов.Количество() > 0 Тогда
		НомерПравильногоОтвета = СтруктураВариантовОтветов.НомерПравильного;
		ТекСложность = Сборник.Сложность;
		Если НЕ ЗначениеЗаполнено(ТекСложность) Тогда
			ТекСложность = Перечисления.СложностиСборников.ШестьОтветов;
		Иначе
			// Сложность указана. Не изменяем.
		КонецЕсли;	
		Если ТекСложность = Перечисления.СложностиСборников.ШестьОтветов Тогда
			ЗагрузитьОтветВЭлемент(МассивОтветов, 5, Элементы.ВыбратьВариант6);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 2, Элементы.ВыбратьВариант3);	
			ЗагрузитьОтветВЭлемент(МассивОтветов, 4, Элементы.ВыбратьВариант5);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 3, Элементы.ВыбратьВариант4);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 1, Элементы.ВыбратьВариант2);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 0, Элементы.ВыбратьВариант1);
		ИначеЕсли Сборник.Сложность = Перечисления.СложностиСборников.ЧетыреОтвета Тогда
			ЗагрузитьОтветВЭлемент(МассивОтветов, 3, Элементы.ВыбратьВариант5);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 2, Элементы.ВыбратьВариант4);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 1, Элементы.ВыбратьВариант2);
			ЗагрузитьОтветВЭлемент(МассивОтветов, 0, Элементы.ВыбратьВариант1);
		Иначе
			// Неизвестный вариант. Пропускаем.
		КонецЕсли;
		ПравильныйОтвет = МассивОтветов[НомерПравильногоОтвета-1];
		ПрименитьМодификаторыПриСобытии(ПредставлениеСобытияФормы_ПриЗагрузкеЗадания());
	Иначе
		Сообщить("Не удалось загрузить ответы");
	КонецЕсли;
КонецПроцедуры

// Возвращает структуру случайного задания по сборнику СборникВход.
&НаСервере
Функция ПолучитьДанныеЗаданияПоСборнику(СборникВход)
	РезультатФункции = Новый Структура;
	Если ЗначениеЗаполнено(СборникВход) Тогда
		НовоеЗадание = Обработки.ТестированиеЗнаний.НайтиСлучайноеЗадание(СборникВход, Гсч);
		ЗагрузитьЗадание(НовоеЗадание);
		НовыйАдресКартинки = ВернутьАдресКартинки(НовоеЗадание);
		РезультатФункции.Вставить("Сборник", СборникВход);
		РезультатФункции.Вставить("Задание", НовоеЗадание);
		РезультатФункции.Вставить("АдресКартинки", НовыйАдресКартинки);
		//АдресСтраницы = "";
		//АдресСтраницы = АдресСтраницы + "https://www.google.ru/search?q=";
		//АдресСтраницы = АдресСтраницы + Строка(НовоеЗадание.ТекстВопросаЗадания);
		//АдресСтраницы = АдресСтраницы + "&newwindow=1&tbm=isch&sa=X";
		//Содержимое = ОбменССайтом.ПолучитьСодержимоеВебАдреса(АдресСтраницы);
		
		
		//АдресСтраницы = "";
		//АдресСтраницы = АдресСтраницы + "https://go.mail.ru/search_images?q=";
		//АдресСтраницы = АдресСтраницы + Строка(НовоеЗадание.ТекстВопросаЗадания);
		////АдресСтраницы = АдресСтраницы + "&newwindow=1&tbm=isch&sa=X";
		//Содержимое = ОбменССайтом.ПолучитьСодержимоеВебАдреса(АдресСтраницы);
		//ПозицияНачало = СтрНайти(Содержимое, ",""url"":""http");
		//Если ПозицияНачало <> 0 Тогда
		//	ПозицияКонец = СтрНайти(Содержимое, """,""", , ПозицияНачало);
		//	Если ПозицияКонец <> 0 Тогда
		//		Длина = ПозицияКонец - ПозицияНачало;
		//		Если Длина <> 0 Тогда
		//			АдресКартинки = Сред(Содержимое, ПозицияНачало + 8, Длина - 8);
		//			Расширение = Прав(АдресКартинки, 3);
		//			ДопустимыеРасширения = Новый Массив;
		//			ДопустимыеРасширения.Добавить("jpg");
		//			ДопустимыеРасширения.Добавить("png");
		//			ДопустимыеРасширения.Добавить("gif");
		//			Если ДопустимыеРасширения.Найти(Расширение) <> Неопределено Тогда
		//				ДвоичныеДанныеКартинки = ОбменССайтом.ПолучитьСодержимоеВебАдреса(АдресКартинки);
		//				НоваяКартинка = Новый Картинка(ДвоичныеДанныеКартинки);
		//				АдресКартинки = ПоместитьВоВременноеХранилище(НоваяКартинка, ЭтаФорма);
		//				РезультатФункции.Вставить("АдресКартинки", АдресКартинки);
		//			Иначе
		//				
		//			КонецЕсли;
		//		Иначе
		//			
		//		КонецЕсли;
		//	Иначе
		//		
		//	КонецЕсли;
		//КонецЕсли;
	Иначе
		РезультатФункции.Вставить("Сборник", Справочники.Сборники.ПустаяСсылка());
		РезультатФункции.Вставить("Задание", Справочники.Задания.ПустаяСсылка());
		РезультатФункции.Вставить("АдресКартинки", "");
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции		// ПолучитьДанныеЗаданияПоСборнику()

// Возвращает случайное задание, заготовленное к повтору
&НаСервере
Функция ВернутьВопросКПовтору()
	РезультатФункции = Новый Структура;
	ВерхняяГраница = ВопросыКПовторениям.Количество();
	Если ВерхняяГраница > 0 Тогда
		ВыбранныйИндекс = ГСЧ.СлучайноеЧисло(0, ВерхняяГраница-1);
		СтрокаВопроса = ВопросыКПовторениям[ВыбранныйИндекс];
		НовоеЗадание = СтрокаВопроса.Вопрос;
		ЗагрузитьЗадание(НовоеЗадание);
		НовыйАдресКартинки = ВернутьАдресКартинки(НовоеЗадание);
		РезультатФункции.Вставить("Сборник", НовоеЗадание.Владелец);
		РезультатФункции.Вставить("Задание", НовоеЗадание);
		РезультатФункции.Вставить("АдресКартинки", НовыйАдресКартинки);
		ВопросыКПовторениям.Удалить(СтрокаВопроса);
	Иначе
		РезультатФункции = Новый Структура;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		 // ВернутьВопросКПовтору()

// Загружает случайное задание из сборника СборникВход
// в режиме викторины РежимВикториныВход. Возвращает структуру, 
// содержащую данные по заданию.
&НаСервере
Функция СледующееЗадание_Сервер(СборникВход, РежимВикториныВход = Неопределено)
	РезультатФункции = Новый Структура;
	ВыбранноеЧисло = Гсч.СлучайноеЧисло(1, 100);
	Если (ВыбранноеЧисло < ВероятностьПовтораНеправильного) И (ВопросыКПовторениям.Количество() > 0) Тогда
		РезультатФункции = ВернутьВопросКПовтору();
	Иначе
		Если РежимВикториныВход = Перечисления.РежимыВикторины.ОдинСборникБезОстановки Тогда
			РезультатФункции = ПолучитьДанныеЗаданияПоСборнику(СборникВход);
		ИначеЕсли РежимВикториныВход = Перечисления.РежимыВикторины.СлучайныйСборник Тогда
			НовыйСборник = Обработки.ТестированиеЗнаний.ПолучитьСлучайныйСборник(ВыбранныеСборники, ГСЧ);
			Сборник = НовыйСборник;
			РезультатФункции = ПолучитьДанныеЗаданияПоСборнику(НовыйСборник);
		ИначеЕсли РежимВикториныВход = Перечисления.РежимыВикторины.Восхождение Тогда
			НовыйСборник = Обработки.ТестированиеЗнаний.ПолучитьСлучайныйСборник(ВыбранныеСборники, ГСЧ);
			Сборник = НовыйСборник;
			РезультатФункции = ПолучитьДанныеЗаданияПоСборнику(НовыйСборник);		
		Иначе
			РезультатФункции = ПолучитьДанныеЗаданияПоСборнику(СборникВход);	
		КонецЕсли;
	КонецЕсли;
	УправлениеВидимостью();
	Возврат РезультатФункции;
КонецФункции		// СледующееЗадание_Сервер()

// Устанавливает достижение Сто вопросов отвечено.
&НаСервереБезКонтекста
Процедура ДостижениеСтоОтветов(КоличествоЗаданныхВход)
	Если ДостиженияКлиентСервер.ЕстьДостижениеСтоОтветов(КоличествоЗаданныхВход) Тогда
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ТекПользователь, Перечисления.Достижения.СтоВопросовСыграно);
	Иначе
		// Критерий не пройден. Не добаляем достижение.
	КонецЕсли;
КонецПроцедуры		// ДостижениеСтоОтветов()

// Устанавливает достижение Тридцать правильных ответов.
&НаКлиенте
Процедура ДостижениеТридцатьБезОшибок(КоличествоВерныхВход)
	Если КоличествоВерныхВход >= 30 Тогда
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ВыбранноеДостижение = ПредопределенноеЗначение("Перечисление.Достижения.ТридцатьВопросовБезОшибок");
		ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ТекПользователь, ВыбранноеДостижение);
	Иначе
		// Критерий не пройден. Не добаляем достижение.
	КонецЕсли;
КонецПроцедуры		// ДостижениеТридцатьБезОшибок()

// Устанавливает достижение Серия двадцать.
&НаКлиенте
Процедура ДостижениеСерияДвадцатьПравильных(СерияВерныхВход)
	Если СерияВерныхВход >= 20 Тогда
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ВыбранноеДостижение = ПредопределенноеЗначение("Перечисление.Достижения.СерияДвадцатьПравильных");
		ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ТекПользователь, ВыбранноеДостижение);
	Иначе
		// Критерий не пройден. Не добаляем достижение.
	КонецЕсли;
КонецПроцедуры		// ДостижениеСерияДвадцатьПравильных()

// Устанавливает достижение Двадцать вопросов за шестьдесят секунд.
&НаКлиенте
Процедура ДостижениеДвадцатьВопросовЗаШестьдесятСекунд(МассивДатВыход)
	Если ДостиженияКлиентСервер.ЕстьДостижениеДвадцатьВопросовЗаШестьдесятСекунд(МассивДатВыход) Тогда
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();  
		ВыбранноеДостижение = ПредопределенноеЗначение("Перечисление.Достижения.ДвадцатьВопросовЗаШестьдесятСекунд");
		ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ТекПользователь, ВыбранноеДостижение);
	Иначе
		// Критерий не пройден. Не добаляем достижение.
	КонецЕсли;
КонецПроцедуры		// ДостижениеДвадцатьВопросовЗаШестьдесятСекунд()

// Начисляет пользователю ПользовательВход опыт в колчиестве НовыйОпытВход.
&НаСервереБезКонтекста
Процедура НачислитьОпыт(ОпытВход, ПользовательВход)
	// Получим имеющиеся данные по пользователю.
	ДанныеПользователя = Справочники.Пользователи.ВернутьДанныеПользователя(ПользовательВход);
	ИмеющийсяОпыт = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПользователя, "Опыт", 0);
	ИмеющийсяУровень = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПользователя, "Уровень", 1);
	// Рассчитаем новый опыт и новый уровень.
	НовыйОпыт = ИмеющийсяОпыт + ОпытВход;
	НовыйУровень = ОбщегоНазначенияКлиентСервер.ВернутьУровеньПоОпыту(НовыйОпыт);
	// Запишем новые значения.
	НаборЗаписей = РегистрыСведений.ДанныеПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПользовательВход); 
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Пользователь	 = ПользовательВход;
	НоваяЗапись.Уровень			 = НовыйУровень;
	НоваяЗапись.Опыт			 = НовыйОпыт;
	НаборЗаписей.Записать(); 
	// Сообщим пользователю, что он достиг нового уровня.
	Если НовыйУровень <> ИмеющийсяУровень Тогда
		Сообщить("Поздравляем! Вы достигли уровня " + Строка(НовыйУровень) + "!");
	Иначе
		// Не требуется сообщать пользователю.
	КонецЕсли;
КонецПроцедуры		// НачислитьОпыт()

// Возвращает ссылку на текущего пользователя из параметра сеанса.
&НаСервереБезКонтекста
Функция ВернутьТекущегоПользователя()
	РезультатФункции = ПараметрыСеанса.ТекущийПользователь;
	Возврат РезультатФункции;
КонецФункции

// Определяет, достигнут ли конец раунда при включенном режиме.
&НаКлиенте
Функция ДостигнутКонецРаунда()
	РезультатФункции = Ложь;
	ЭтоРежимИспытание = (РежимВикторины = ПредопределенноеЗначение("Перечисление.РежимыВикторины.Испытание"));
	ДостигнутПределЗаданных = (КоличествоЗаданных >= КоличествоЗаданийВРаунде);
	РезультатФункции = (ЭтоРежимИспытание И ДостигнутПределЗаданных);
	Возврат РезультатФункции;
КонецФункции		// ДостигнутКонецРаунда()

// Изменяет фон у команды ответа сборника СборникВход с номером 
// НомерОтветаВход.
&НаКлиенте
Процедура ПодсветитьПравильныйОтвет(НомерОтветаВход, СборникВход)
	ВыбранныйЭлемент = Неопределено;
	Сложность = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизита(СборникВход, "Сложность");
	Если Сложность = ПредопределенноеЗначение("Перечисление.СложностиСборников.ШестьОтветов") Тогда
		Если НомерОтветаВход = 1 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант1;
		ИначеЕсли НомерОтветаВход = 2 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант2;
		ИначеЕсли НомерОтветаВход = 3 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант3;
		ИначеЕсли НомерОтветаВход = 4 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант4;
		ИначеЕсли НомерОтветаВход = 5 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант5;
		ИначеЕсли НомерОтветаВход = 6 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант6;
		Иначе
			ВыбранныйЭлемент = Неопределено;
		КонецЕсли;
	ИначеЕсли Сложность = ПредопределенноеЗначение("Перечисление.СложностиСборников.ЧетыреОтвета") Тогда
		Если НомерОтветаВход = 1 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант1;
		ИначеЕсли НомерОтветаВход = 2 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант2;
		ИначеЕсли НомерОтветаВход = 3 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант4;
		ИначеЕсли НомерОтветаВход = 4 Тогда
			ВыбранныйЭлемент = Элементы.ВыбратьВариант5;
		Иначе
			ВыбранныйЭлемент = Неопределено;
		КонецЕсли;
	Иначе
		ВыбранныйЭлемент = Неопределено;
	КонецЕсли;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ВыбранныйЭлемент.ЦветФона = WebЦвета.СветлоНебесноГолубой;
	Иначе
		Сообщить(НСтр("ru = 'Не удалось определить элемент для подстветки привильного ответа'"));
	КонецЕсли;
КонецПроцедуры		// ПодсветитьПравильныйОтвет()

// Устанавливает достижения, привязанные к выбору правильного ответа.
&НаКлиенте
Процедура ОбработатьДостиженияВыборОтвета()
	ДостижениеСтоОтветов(КоличествоЗаданных);
	ДостижениеТридцатьБезОшибок(КоличествоВерных);
	ДостижениеСерияДвадцатьПравильных(СерияПравильных);
	ДостижениеДвадцатьВопросовЗаШестьдесятСекунд(ДатыОтветов.ВыгрузитьЗначения());
КонецПроцедуры		// ОбработатьДостиженияВыборОтвета()

// Вызывается при окончании обработки неправильного ответа.
&НаКлиенте
Процедура ОбработкаНеправильногоОтвета()
	// Инициализация.
	УронНеправильногоОтвета = 5;
	ЭтоРежимВосхождения = (РежимВикторины = ПредопределенноеЗначение("Перечисление.РежимыВикторины.Восхождение"));
	// Подсветим правильный ответ.
	ПоказатьПредупреждение(, "Правильный ответ №" + Строка(НомерПравильногоОтвета), 15);
	ПодсветитьПравильныйОтвет(НомерПравильногоОтвета, Сборник);
	Если НЕ ОтветДан Тогда
		НовыйОпыт = 1;
		// Уменьшим здоровье игрока для режима Восхождения.
		Если ЭтоРежимВосхождения Тогда
			ТекущееЗдоровьеИгрока = ТекущееЗдоровьеИгрока - УронНеправильногоОтвета;
		Иначе
			// Не изменяем здоровье для прочих режимов.
		КонецЕсли;
	Иначе
		НовыйОпыт = 0;
	КонецЕсли;
	ОтветДан = Истина;
	СерияПравильных = 0;
	// Добавим задание в таблицу к повтору.
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Вопрос", ВыбранноеЗадание);
	НайденныеСтроки = ВопросыКПовторениям.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ВопросыКПовторениям.Добавить();
		НоваяСтрока.Вопрос = ВыбранноеЗадание;
	Иначе
		// Вопрос уже присутсвует.
	КонецЕсли;	
КонецПроцедуры		// ОбработкаНеправильногоОтвета()

&НаКлиенте
Процедура ПодтверждениеИспользованиеПодсказкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработкаУбратьНевернуюПоловину();
	Иначе
		ОбработкаНеправильногоОтвета();
	КонецЕсли;
КонецПроцедуры		// ПодтверждениеИспользованиеПодсказкиЗавершение()

// Добавляет в регистр РезультатыТестированияЗнаний запись об отвеченном задании
// в сборнике СборникВход по пользователю ПользовательВход. Когда ВерноВход
// Истина, будет записан результат верного ответа, иначе - неверного.
&НаСервереБезКонтекста
Процедура ЗаписатьОтветВРезультаты(СборникВход, ПользовательВход, ВерноВход) Экспорт
	Обработки.ТестированиеЗнаний.ЗаписатьОтветВРезультаты(СборникВход, ПользовательВход, ВерноВход);
КонецПроцедуры

// Фиксирует ответ пользователя номер НомерОтветаВход.
&НаКлиенте
Процедура ВыбратьВариантОтвета(НомерОтветаВход)
	ВероятностьПодсказки = 11;
	НовыйНомерПравильногоОтвета = ПреобразоватьНомерПравильногоОтвета(НомерПравильногоОтвета, Сборник);
	ЭтоВерныйОтвет = (НомерОтветаВход = НовыйНомерПравильногоОтвета);
	НовыйОпыт = 0;
	Если ЭтоВерныйОтвет Тогда
		Если НЕ ОтветДан Тогда
			КоличествоВерных = КоличествоВерных + 1;
			СерияПравильных = СерияПравильных + 1;
			НовыйОпыт = 3;
		Иначе
			// Не увеличиваем количество верных ответов.
		КонецЕсли;
		Если ДостигнутКонецРаунда() Тогда
			Сообщить("Задано " + Строка(КоличествоЗаданных) + " вопросов. Верно отвечено: " + Строка(КоличествоВерных));
			ОтобразитьСледующееЗадание(Сборник);
		Иначе
			ОтобразитьСледующееЗадание(Сборник);
		КонецЕсли;
	Иначе      
		СтруктураПараметров = Новый Структура;
		ВыбранноеЧисло = ГсчКлиент.СлучайноеЧисло(1, 100);
		Если (ВыбранноеЧисло < ВероятностьПодсказки) Тогда
			ТекстВопроса = НСтр("ru = 'Ответ неверный. Хотите использовать подсказку?'");
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПодтверждениеИспользованиеПодсказкиЗавершение", ЭтаФорма, СтруктураПараметров);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		Иначе                       
			ОбработкаНеправильногоОтвета();
		КонецЕсли;
	КонецЕсли;
	ОбработатьДостиженияВыборОтвета();
	НачислитьОпыт(НовыйОпыт, ТекПользователь);
	ЗаписатьОтветВРезультаты(Сборник, ТекПользователь, ЭтоВерныйОтвет);
КонецПроцедуры		// ВыбратьВариантОтвета()

// Преобразует номер правильного ответа ИсходныйНомерПравильногоОтветаВход
// в номер ответа на командах формы, ориентируясь на сложность сборника 
// СборникВход.
&НаСервереБезКонтекста
Функция ПреобразоватьНомерПравильногоОтвета(ИсходныйНомерПравильногоОтветаВход, СборникВход)
	РезультатФункции = Обработки.ТестированиеЗнаний.ПреобразоватьНомерПравильногоОтвета(ИсходныйНомерПравильногоОтветаВход, СборникВход);
	Возврат РезультатФункции;
КонецФункции		// ПреобразоватьНомерПравильногоОтвета()

// Управляет видимостью элементов на форме.
&НаСервере
Процедура УправлениеВидимостью()
	// Количество ответов.
	СложностьСборника = Сборник.Сложность;
	Если (НЕ ЗначениеЗаполнено(СложностьСборника)) ИЛИ (СложностьСборника = Перечисления.СложностиСборников.ШестьОтветов) Тогда
		Элементы.ВыбратьВариант3.Видимость = Истина;
		Элементы.ВыбратьВариант6.Видимость = Истина;
	ИначеЕсли (СложностьСборника = Перечисления.СложностиСборников.ЧетыреОтвета) Тогда
		Элементы.ВыбратьВариант3.Видимость = Ложь;
		Элементы.ВыбратьВариант6.Видимость = Ложь;	
	Иначе
		Элементы.ВыбратьВариант3.Видимость = Ложь;
		Элементы.ВыбратьВариант6.Видимость = Ложь;
	КонецЕсли;	
	// Не показывать пустой вопрос.
	ПустоеЗадание = (СокрЛП(ВыбранноеЗадание.ТекстВопросаЗадания) = "" ИЛИ СокрЛП(ВыбранноеЗадание.ТекстВопросаЗадания) = "-");
	Элементы.ЗаданиеТекстВопросаЗадания.Видимость = НЕ ПустоеЗадание;
	Элементы.УбратьНевернуюПоловину.Доступность = НЕ НеверныеВариантыУбраны;
	// Скрывать подсказки для режима Восхождение.
	ЭтоРежимВосхождение = (РежимВикторины = Перечисления.РежимыВикторины.Восхождение);
	Элементы.ГруппаПодменюПодсказки.Видимость = НЕ (ЭтоРежимВосхождение);
	// Отображение информации об игре в режиме Восхождение.
	Элементы.ГруппаСтраницаОбИгре.Видимость = ЭтоРежимВосхождение;
	Если ЭтоРежимВосхождение Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
КонецПроцедуры		// УправлениеВидимостью()

// Возвращает текст вопроса задания ЗаданиеВход.
&НаСервереБезКонтекста
Функция ПолучитьТекстВопроса(ЗаданиеВход)
	РезультатФункции = ЗаданиеВход.ТекстВопросаЗадания;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьТекстВопроса()

// Возвращает массив номеров неправильных ответов, которые необходимо
// удалить для подсказки 50/50.
&НаСервере
Функция ПолучитьМассивНеправильныхОтветовКУдалению(НомерПравильногоОтветаВход, СборникВход)
	РезультатФункции = Новый Массив;
	НовыйНомерПравильногоОтвета = ПреобразоватьНомерПравильногоОтвета(НомерПравильногоОтветаВход, СборникВход);
	ТекСложность = СборникВход.Сложность;
	Если ТекСложность = Перечисления.СложностиСборников.ШестьОтветов Тогда
		РезультатФункции = Обработки.ТестированиеЗнаний.ПолучитьМассивОтветовКУдалениюПоКоличеству(НомерПравильногоОтветаВход, ГСЧ, 6);
	ИначеЕсли ТекСложность = Перечисления.СложностиСборников.ЧетыреОтвета Тогда
		ВремРезультат = Обработки.ТестированиеЗнаний.ПолучитьМассивОтветовКУдалениюПоКоличеству(НомерПравильногоОтветаВход, ГСЧ, 4);
		Для Каждого ТекВремРезультат Из ВремРезультат Цикл
			НовыйНомер = ПреобразоватьНомерПравильногоОтвета(ТекВремРезультат, СборникВход);
			РезультатФункции.Добавить(НовыйНомер);
		КонецЦикла;	
	Иначе
		РезультатФункции = Новый Массив;
		ТекстСообщения = НСтр("ru = 'Неизвестный вариант сложности: %Сложность%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сложность%", Строка(ТекСложность));
		Сообщить(ТекстСообщения);
	КонецЕсли;	
	Возврат РезультатФункции;
КонецФункции		// ПолучитьМассивНеправильныхОтветовКУдалению()

// Получает и выводит следующее задание на форму.
&НаКлиенте
Процедура ОтобразитьСледующееЗадание(СборникВход)
	НеверныеВариантыУбраны = Ложь;
	
	Элементы.ВыбратьВариант1.Доступность = Истина;
	Элементы.ВыбратьВариант2.Доступность = Истина;
	Элементы.ВыбратьВариант3.Доступность = Истина;
	Элементы.ВыбратьВариант4.Доступность = Истина;
	Элементы.ВыбратьВариант5.Доступность = Истина;
	Элементы.ВыбратьВариант6.Доступность = Истина;

	Элементы.ВыбратьВариант1.ЦветФона = Новый Цвет();
	Элементы.ВыбратьВариант2.ЦветФона = Новый Цвет();
	Элементы.ВыбратьВариант3.ЦветФона = Новый Цвет();
	Элементы.ВыбратьВариант4.ЦветФона = Новый Цвет();
	Элементы.ВыбратьВариант5.ЦветФона = Новый Цвет();
	Элементы.ВыбратьВариант6.ЦветФона = Новый Цвет();

	РезультатСмены = СледующееЗадание_Сервер(СборникВход, РежимВикторины);	
	Сборник = РезультатСмены.Сборник;
	АдресКартинки = РезультатСмены.АдресКартинки;
	КоличествоЗаданных = КоличествоЗаданных + 1;
	ОтветДан = Ложь;
	ЭтаФорма.Заголовок = Строка(Сборник);
	
	ДобавитьТекущуюДатуВСтек();
КонецПроцедуры

// Блокирует команды с неверными ответами по номерам массива МассивНеверных.
&НаКлиентеНаСервереБезКонтекста
Процедура УбратьНеверныеОтветы(МассивНеверных, Форма)
	Если МассивНеверных.Найти(1) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант1.Доступность = Ложь;
	КонецЕсли;
	Если МассивНеверных.Найти(2) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант2.Доступность = Ложь;
	КонецЕсли;
	Если МассивНеверных.Найти(3) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант3.Доступность = Ложь;
	КонецЕсли;
	Если МассивНеверных.Найти(4) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант4.Доступность = Ложь;
	КонецЕсли;
	Если МассивНеверных.Найти(5) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант5.Доступность = Ложь;
	КонецЕсли;
	Если МассивНеверных.Найти(6) <> Неопределено Тогда
		Форма.Элементы.ВыбратьВариант6.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры		// УбратьНеверныеОтветы()

// Добавляет в стек ДатыОтветов текущую дату
&НаКлиенте
Процедура ДобавитьТекущуюДатуВСтек()
	РазмерСтекаДат = 20;
	ТекДата = ТекущаяДата();
	НовыйСписокДаты = Новый СписокЗначений;
	НовыйСписокДаты.Добавить(ТекДата);
	Если ДатыОтветов.Количество() < РазмерСтекаДат Тогда
		Для Каждого ТекДатыОтветов Из ДатыОтветов Цикл
			НовыйСписокДаты.Добавить(ТекДатыОтветов.Значение);
		КонецЦикла;	
	Иначе
		Для Счетчик = 0 По РазмерСтекаДат - 2 Цикл
			ТекДатыОтветов = ДатыОтветов.Получить(Счетчик);
			НовыйСписокДаты.Добавить(ТекДатыОтветов.Значение);
		КонецЦикла;
	КонецЕсли;
	МассивДат = НовыйСписокДаты.ВыгрузитьЗначения();
	ДатыОтветов.ЗагрузитьЗначения(МассивДат);
КонецПроцедуры		// ДобавитьТекущуюДатуВСтек()

// Выполняет удаление половины неправильных ответов на вопрос.
&НаКлиенте
Процедура ОбработкаУбратьНевернуюПоловину()
	МассивНеверных = ПолучитьМассивНеправильныхОтветовКУдалению(НомерПравильногоОтвета, Сборник);
	УбратьНеверныеОтветы(МассивНеверных, ЭтаФорма);
	НеверныеВариантыУбраны = Истина;
	УправлениеВидимостью();
КонецПроцедуры		// ОбработкаУбратьНевернуюПоловину()

&НаКлиенте
Процедура НастройкиВикторины_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ТекПользователь		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "Пользователь", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
		НовыйСборник		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "Сборник", ПредопределенноеЗначение("Справочник.Сборники.ПустаяСсылка"));
		РежимВикторины		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "РежимВикторины", ПредопределенноеЗначение("Перечисление.РежимыВикторины.ОдинСборникБезОстановки"));
		ВыбранныеСборники	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "ВыбранныеСборники", Новый СписокЗначений);
		Если НовыйСборник <> Сборник Тогда
			Сборник = НовыйСборник;
			УправлениеВидимостью();
			КоличествоВерных = 0;
			КоличествоЗаданных = 0;
			ОтобразитьСледующееЗадание(Сборник);
		Иначе
			// Сборник не изменился. Не отображаем новый вопрос.
		КонецЕсли;
	Иначе
		// Не изменяем значения настроек.
	КонецЕсли;
КонецПроцедуры		// НастройкиВикторины_Завершение()

&НаКлиенте
Процедура СборникПриИзменении(Элемент)
	УправлениеВидимостью();
	КоличествоВерных = 0;
	КоличествоЗаданных = 0;
	ОтобразитьСледующееЗадание(Сборник);
КонецПроцедуры

// Добавляет модификаторы по умолчанию в таблицу Модификаторы.
//
&НаСервере
Процедура ЗагрузитьМодификаторыПоУмолчанию()
	Модификаторы.Очистить();
	// Загрузим один положительный и один отрицательный модификатор.
	ПоложительныйМодификатор = Справочники.Модификаторы.ВернутьМодификатор(Истина, Гсч);
	Если ЗначениеЗаполнено(ПоложительныйМодификатор) Тогда
		НоваяСтрока = Модификаторы.Добавить();
		НоваяСтрока.Модификатор = ПоложительныйМодификатор;
	Иначе
		// Положительный модификатор не найден.
	КонецЕсли;
	ОтрицательныйМодификатор = Справочники.Модификаторы.ВернутьМодификатор(Ложь, Гсч);
	Если ЗначениеЗаполнено(ОтрицательныйМодификатор) Тогда
		НоваяСтрока = Модификаторы.Добавить();
		НоваяСтрока.Модификатор = ОтрицательныйМодификатор;
	Иначе
		// Отрицательный модификатор не найден.
	КонецЕсли;
КонецПроцедуры		// ЗагрузитьМодификаторыПоУмолчанию()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация.
	КоличествоВерных = 0;	
	КоличествоЗаданных = 0;
	СерияПравильных = 0;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	// Считывание параметров.
	Если ЗначениеЗаполнено(Параметры.Сборник) Тогда
		Сборник = Параметры.Сборник;
	Иначе
		// Параметры не переданы. Не требуется обновлять сборник.
	КонецЕсли;
	ВыбранныеСборники = Параметры.ВыбранныеСборники;
	// Считвание констант.
	КоличествоЗаданийВРаунде = Константы.КоличествоЗаданийВРаунде.Получить();
	Если НЕ ЗначениеЗаполнено(КоличествоЗаданийВРаунде) Тогда
		КоличествоЗаданийВРаунде = 100;
	Иначе
		// Значение установлено.
	КонецЕсли;
	ВероятностьПовтораНеправильного = Константы.ВероятностьПовтораНеправильного.Получить();
	// Инициализация игры для режима "Восхождение"
	Если РежимВикторины = Перечисления.РежимыВикторины.Восхождение Тогда
		ИнициализироватьРежимВосхождение();
	Иначе
		// Для прочих вариантов не инициализируем.
	КонецЕсли;
	// Управление видимостью.
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант1(Команда)
	ВыбратьВариантОтвета(1);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант2(Команда)
	ВыбратьВариантОтвета(2);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант3(Команда)
	ВыбратьВариантОтвета(3);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант4(Команда)
	ВыбратьВариантОтвета(4);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант5(Команда)
	ВыбратьВариантОтвета(5);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант6(Команда)
	ВыбратьВариантОтвета(6);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПользователя_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
    Если ВыбранноеЗначение <> Неопределено Тогда
        ТекПользователь = ВыбранноеЗначение;
		ОтобразитьСледующееЗадание(Сборник);
	Иначе
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		Иначе
			
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхНастроек_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	// Инициализация.
	ПустойПользователь		 = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ПустойРежимВикторины	 = ПредопределенноеЗначение("Перечисление.РежимыВикторины.ПустаяСсылка");
	ПустойСборник			 = ПредопределенноеЗначение("Справочник.Сборники.ПустаяСсылка");
	РежимВикториныВосхождение = ПредопределенноеЗначение("Перечисление.РежимыВикторины.Восхождение");  
	// Получим данные из оповещения.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Пользователь		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "Пользователь", ПустойПользователь);
		РежимВикторины		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "РежимВикторины", ПустойРежимВикторины);
		Сборник				 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "Сборник", ПустойСборник);
		ВыбранныеСборники	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "ВыбранныеСборники", Новый СписокЗначений);
	Иначе
		Пользователь		 = ПустойПользователь;
		РежимВикторины		 = ПустойРежимВикторины;
		Сборник				 = ПустойСборник;
		ВыбранныеСборники	 = Новый СписокЗначений;
	КонецЕсли;
	// Модификаторы, загружаем только в режиме восхождения.
	ЭтоРежимВосхождение = (РежимВикторины = РежимВикториныВосхождение);
	Если ЭтоРежимВосхождение Тогда
		ИнициализироватьРежимВосхождение();
	Иначе
		Модификаторы.Очистить();
	КонецЕсли;
	// Отобразим задание из выбранного сборника.
	Если ЗначениеЗаполнено(Сборник) Тогда
		ОтобразитьСледующееЗадание(Сборник);
	Иначе
		// Сборник не выбран.
	КонецЕсли;	
КонецПроцедуры		// ВводНачальныхНастроек_Завершение()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоВерных = 0;
	КоличествоЗаданных = 0;
	ГсчКлиент = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	ОписаниеОЗакрытии = Новый ОписаниеОповещения("ВводНачальныхНастроек_Завершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сборник", Сборник);
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаНачальныхНастроек", ПараметрыФормы, , , , , ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Подсказка(Команда)
	ТекстВопроса = СокрЛП(ПолучитьТекстВопроса(ВыбранноеЗадание));
	ТекстПодсказки = ОбщегоНазначенияКлиентСервер.ПолучитьТекстПодсказки(ТекстВопроса, СокрЛП(ПравильныйОтвет));
	ОбщегоНазначенияКлиент.ПоказатьОкноСообщения(ТекстПодсказки, "Подсказка", ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьВИнтернете(Команда)
	ТекстВопроса = ПолучитьТекстВопроса(ВыбранноеЗадание);
	ТекстВопроса = СтрЗаменить(ТекстВопроса, """", "");		// Удалим кавычки.
	Если СокрЛП(ТекстВопроса) <> "" Тогда
		ТекстПоиска = "https://www.google.com/search?q=";
		ТекстПоиска = ТекстПоиска + Строка(ТекстВопроса);
		ЗапуститьПриложение(ТекстПоиска);
	Иначе
		Сообщить("Текст вопроса пустой");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сборник", Сборник);
	ПараметрыФормы.Вставить("РежимВикторины", РежимВикторины);
	ПараметрыФормы.Вставить("Пользователь", ТекПользователь);
	ОписаниеОЗакрытии = Новый ОписаниеОповещения("НастройкиВикторины_Завершение", ЭтаФорма);
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаНастроекВикторины", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "Викторина");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура УбратьНевернуюПоловину(Команда)
	ОбработкаУбратьНевернуюПоловину();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресКартинки", АдресКартинки);
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаПросмотраКартинки", СтруктураПараметров);
КонецПроцедуры

Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
